Config/Documents/СписаниеОбъектаИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеОбъектаИК</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Comment>Текст причины списания для печати в акте</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСписанияСБухУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияИК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияОС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/AccumulationRegisters/НаличиеДрагМатериаловВОбъектахНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НаличиеДрагМатериаловВОбъектахНФА</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МассаДМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоСписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыАналитикиОперацииСДрагМатериалами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНФА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДрагМатериала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрагМеталлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыСобытийОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСобытийОС</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реконструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие состояния (пользовательские)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзБезвозмездногоПользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расконсервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЛичноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзЛичногоПользования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/СписаниеОбъектаИК/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
 
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента", "Списание объекта ИК (Акт списания ОС-4)");
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка КАК Ссылка,
	|	ТаблицаОсновныеСредства.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Дата КАК Дата,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Номер КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаДокумента,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	1 КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ТаблицаОсновныеСредства.ПричинаСписания КАК ПричинаСписания
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.СписаниеОбъектаИК КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	НомераТаблиц.Вставить("МестонахождениеОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК ЦМО,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета) КАК Состояние,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	// Движения по регистрам СтоимостьОбъектовОС и АмортизацияОбъектовОС.
	ПараметрыСписания = УправлениеОсновнымиСредствами.ПараметрыСписанияОСПоРегистрамНакопления();
	ПараметрыСписания.ЭтоИмуществоКазны = Истина;
	УправлениеОсновнымиСредствами.ДобавитьТаблицыСписанияОСПоРегистрамНакопления(Запрос, НомераТаблиц,
		ДокументСсылка, ПараметрыСписания);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СписаниеОбъектаИК";
	КомандаПечати.Идентификатор		= "ОС4";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о списании объекта ОС (ОС-4)'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем ТабличныйДокумент1, ТабличныйДокумент2, ТабличныйДокумент3;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОС4") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС4","ОС-4", ПодготовитьОС4(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПодготовитьОС4(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеИнвентарногоОбъектаОС_ОС4";

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеОбъектаИК.Ссылка КАК Ссылка,
	               |	СписаниеОбъектаИК.Дата КАК пДата,
	               |	СписаниеОбъектаИК.Номер КАК НомерАкта,
	               |	СписаниеОбъектаИК.Организация КАК Организация,
	               |	СписаниеОбъектаИК.Организация.НаименованиеПолное КАК ОргНазв,
	               |	СписаниеОбъектаИК.Организация.КодОКПО КАК КодОКПО,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеОбъектаИК.Подразделение) КАК Подразделение,
	               |	СписаниеОбъектаИК.ОснованиеДляАкта КАК ОснованиеДляАкта,
	               |	СписаниеОбъектаИК.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	               |	СписаниеОбъектаИК.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	               |	СписаниеОбъектаИК.ДатаСписанияСБухУчета КАК ДатаСписания,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеОбъектаИК.КФО) КАК КФО,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеОбъектаИК.КПС) КАК КПС,
	               |	СписаниеОбъектаИК.ОсновноеСредство.КодОКОФ.Код КАК пКодПоОКОФ,
	               |	ВЫБОР
	               |		КОГДА СписаниеОбъектаИК.ОсновноеСредство.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка)
	               |			ТОГДА """"
	               |		ИНАЧЕ СписаниеОбъектаИК.ОсновноеСредство.АмортизационнаяГруппа.Порядок + 1
	               |	КОНЕЦ КАК НомерАмортГруппы,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеОбъектаИК.ИнвентарныйНомер) КАК ИнвНомер,
	               |	СписаниеОбъектаИК.ИнвентарныйНомер.ЗаводскойНомер КАК пЗавНомер,
	               |	СписаниеОбъектаИК.ОсновноеСредство.ИзготовительОС.НаименованиеПолное КАК Изготовитель,
	               |	СобытияОС_ВводВЭксплуатацию.Период КАК ДатаВвода,
	               |	СписаниеОбъектаИК.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска,
	               |	СписаниеОбъектаИК.СуммаАмортизации + ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма, 0) КАК НачАмортизация,
	               |	СписаниеОбъектаИК.Сумма - СписаниеОбъектаИК.СуммаАмортизации - ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма, 0) КАК ОстСтоимость,
	               |	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК МОЛ,
	               |	СписаниеОбъектаИК.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	               |	СписаниеОбъектаИК.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	               |	СписаниеОбъектаИК.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	               |	СписаниеОбъектаИК.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	               |	"""" КАК ТабНомМОЛ,
	               |	СписаниеОбъектаИК.ОсновноеСредство КАК ОсновноеСредство,
	               |	ВЫБОР
	               |		КОГДА СписаниеОбъектаИК.ОсновноеСредство.НаименованиеПолное = """"
	               |			ТОГДА СписаниеОбъектаИК.ОсновноеСредство.Наименование
	               |		ИНАЧЕ СписаниеОбъектаИК.ОсновноеСредство.НаименованиеПолное
	               |	КОНЕЦ КАК НаимОС,
	               |	СписаниеОбъектаИК.ПричинаСписания КАК ТекстПричинаСписания,
	               |	СписаниеОбъектаИК.Приложение КАК ТекстПриложения,
	               |	СписаниеОбъектаИК.Сумма КАК НачСтоимость,
	               |	СписаниеОбъектаИК.ИнвентарныйНомер КАК ИнвентарныйНомер
	               |ИЗ
	               |	Документ.СписаниеОбъектаИК КАК СписаниеОбъектаИК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК СобытияОС_ВводВЭксплуатацию
	               |		ПО СписаниеОбъектаИК.ОсновноеСредство = СобытияОС_ВводВЭксплуатацию.ОсновноеСредство
	               |			И (СобытияОС_ВводВЭксплуатацию.Событие = &ВводВЭксплуатацию)
	               |			И СписаниеОбъектаИК.ИнвентарныйНомер = СобытияОС_ВводВЭксплуатацию.ИнвНомер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	               |				,
	               |				,
	               |				Регистратор В (&МассивОбъектов)
	               |					И СчетКт В (&Счет10450),
	               |				,
	               |				) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	               |		ПО СписаниеОбъектаИК.Ссылка = ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор
	               |ГДЕ
	               |	СписаниеОбъектаИК.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	пДата,
	               |	НомерАкта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА КАК ОсновноеСредство,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА КАК Справочник.ОсновныеСредства).НаименованиеПолное + "" / "" + ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ИнвНомер КАК Справочник.ИнвентарныеНомераОС).Код КАК НазвДетали,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Наименование КАК Драгметалл,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Код КАК КодДрагМеталла,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ЕдИзм КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК НазвЕИ,
	               |	ЕСТЬNULL(НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток, 0) КАК ВесДраг
	               |ИЗ
	               |	Документ.СписаниеОбъектаИК КАК СписаниеОбъектаИК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВОбъектахНФА.Остатки КАК НаличиеДрагМатериаловВОбъектахНФАОстатки
	               |		ПО СписаниеОбъектаИК.ОсновноеСредство = НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА
	               |			И СписаниеОбъектаИК.ИнвентарныйНомер = НаличиеДрагМатериаловВОбъектахНФАОстатки.ИнвНомер
	               |ГДЕ
	               |	СписаниеОбъектаИК.Ссылка В(&МассивОбъектов)
	               |ИТОГИ ПО
	               |	ОсновноеСредство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписаниеОбъектаИКСоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	               |	СписаниеОбъектаИКСоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	               |	СписаниеОбъектаИКСоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	               |	СписаниеОбъектаИКСоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии,
	               |	СписаниеОбъектаИКСоставКомиссии.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СписаниеОбъектаИК.СоставКомиссии КАК СписаниеОбъектаИКСоставКомиссии
	               |ГДЕ
	               |	СписаниеОбъектаИКСоставКомиссии.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СписаниеОбъектаИКСоставКомиссии.НомерСтроки
	               |ИТОГИ ПО
	               |	Ссылка";
				   
	Запрос.УстановитьПараметр("МассивОбъектов"		, МассивОбъектов);
	Запрос.УстановитьПараметр("ВводВЭксплуатацию"	, Перечисления.ВидыСобытийОС.ВводВЭксплуатацию);
	Запрос.УстановитьПараметр("Счет10450"			, БухгалтерскийУчет.СписокСчетов("104.50"));
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка 			= Результат[0].Выбрать();
	ВыборкаДрагМеталлы 		= Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссия 		= Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ОС_4");
	ОблАкт			= Макет.ПолучитьОбласть("Акт");
	ОблАкт_2		= Макет.ПолучитьОбласть("Акт_2");
	ОблДрагметалл	= Макет.ПолучитьОбласть("Драгметалл");
	ОблДрагметалл_2	= Макет.ПолучитьОбласть("Драгметалл_2");
	ОблАкт_2_2		= Макет.ПолучитьОбласть("Акт_2_2");
	ОблКомиссия		= Макет.ПолучитьОбласть("Комиссия");
	ОблАкт_3		= Макет.ПолучитьОбласть("Акт_3");
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
    	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОтветственныеЛица = ОрганизационнаяСтруктураПовтИсп.ОтветственныеЛицаОрганизации(ВыборкаШапка.Организация, ВыборкаШапка.пДата);
		
	    ОблАкт.Параметры.Заполнить(ВыборкаШапка);
		СтруктураОблАкт = Новый Структура("РукДолжн,ОргДиректор,СрокЭкспл,НомерАкта");
		СтрРуководитель = ОтветственныеЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Если СтрРуководитель<>Неопределено Тогда
			СтруктураОблАкт.РукДолжн = СтрРуководитель.ДолжностьПредставление;
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтрРуководитель.ОтветственноеЛицоСсылка, ВыборкаШапка.пДата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураОблАкт.ОргДиректор = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		КонецЕсли;
		
		СтруктураОблАкт.СрокЭкспл = УправлениеОсновнымиСредствами.РассчитатьСрокЭксплуатации(	ВыборкаШапка.ОсновноеСредство,
																								ВыборкаШапка.ИнвентарныйНомер,
																								ВыборкаШапка.Организация,
																								ВыборкаШапка.пДата).СрокЭкспл;
		СтруктураОблАкт.НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапка.Ссылка,ВыборкаШапка.НомерАкта);																						
		ОблАкт.Параметры.Заполнить(СтруктураОблАкт);
		ТабличныйДокумент.Вывести(ОблАкт);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент.Вывести(ОблАкт_2);
		
	    // драгметаллы
		ВыборкаДрагМеталлы.Сбросить();
		ВывелиСтрок = 0;
		Если ВыборкаДрагМеталлы.НайтиСледующий(ВыборкаШапка.ОсновноеСредство, "ОсновноеСредство") Тогда
			
			ДрагМеталлы = ВыборкаДрагМеталлы.Выбрать();
			Пока ДрагМеталлы.Следующий() Цикл
				
				ОблДрагметалл.Параметры.Заполнить(ДрагМеталлы);
				ТабличныйДокумент.Вывести(ОблДрагметалл);
				ВывелиСтрок = ВывелиСтрок + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		Для Счетчик = ВывелиСтрок По 3 Цикл
			ТабличныйДокумент.Вывести(ОблДрагметалл_2);
		КонецЦикла;
		
		ОблАкт_2_2.Параметры.Заполнить(ВыборкаШапка);
	    ТабличныйДокумент.Вывести(ОблАкт_2_2);
		
		// Комиссия
		пСтатусЧленаКомиссии	= "Председатель комиссии";
		пДолжностьЧленаКомиссии = ВыборкаШапка.ДолжностьПредседателяКомиссии;
		Если ЗначениеЗаполнено(ВыборкаШапка.ФамилияПредседателяКомиссии) Тогда
			пЧленКомиссии			= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
	               																ВыборкаШапка.ФамилияПредседателяКомиссии,
	               																ВыборкаШапка.ИмяПредседателяКомиссии,
	               																ВыборкаШапка.ОтчествоПредседателяКомиссии));
		Иначе																				
			пЧленКомиссии			= "";
		КонецЕсли;
		СтуктураОблКомиссия = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии",
												пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии);
		ОблКомиссия.Параметры.Заполнить(СтуктураОблКомиссия);
		ТабличныйДокумент.Вывести(ОблКомиссия);
		
		пСтатусЧленаКомиссии = "Члены комиссии:";
		ВыборкаКомиссия.Сбросить();
		ВывелиСтрок = 0;
		Если ВыборкаКомиссия.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка") Тогда
			
			Комиссия = ВыборкаКомиссия.Выбрать();
			Пока Комиссия.Следующий() Цикл
				ВывелиСтрок = ВывелиСтрок + 1;
				пДолжностьЧленаКомиссии = Комиссия.ДолжностьЧленаКомиссии;
				пЧленКомиссии			= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
			               																Комиссия.ФамилияЧленаКомиссии,
			               																Комиссия.ИмяЧленаКомиссии,
			               																Комиссия.ОтчествоЧленаКомиссии));
				СтуктураОблКомиссия = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии",
													пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии);
				ОблКомиссия.Параметры.Заполнить(СтуктураОблКомиссия);
				ТабличныйДокумент.Вывести(ОблКомиссия);
				
				пСтатусЧленаКомиссии = "";
				
			КонецЦикла;
			
		КонецЕсли;
		Для Счетчик=ВывелиСтрок По 2 Цикл
			СтуктураОблКомиссия = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии",
												пСтатусЧленаКомиссии,"","");
			ОблКомиссия.Параметры.Заполнить(СтуктураОблКомиссия);
			ТабличныйДокумент.Вывести(ОблКомиссия);
			
			пСтатусЧленаКомиссии = "";
		КонецЦикла;
		
		СтрГлБухгалтер = ОтветственныеЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Если СтрГлБухгалтер<>Неопределено Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтрГлБухгалтер.ОтветственноеЛицоСсылка, ВыборкаШапка.пДата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			ОблАкт_3.Параметры.Заполнить(Новый Структура("ОргБухгалтер", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина)));
		Иначе
			ОблАкт_3.Параметры.Заполнить(Новый Структура("ОргБухгалтер", ""));
		КонецЕсли;
		
	    ТабличныйДокумент.Вывести(ОблАкт_3);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

#КонецЕсли
